# Exercise 11 - Pandas

Write a Pandas program to split the following given dataframe into groups based on `school code` and `class`.

student_data = pd.DataFrame({  
    'school_code': ['s001','s002','s003','s001','s002','s004'],  
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],  
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],  
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],  
    'age': [12, 12, 13, 13, 14, 12],  
    'height': [173, 192, 186, 167, 151, 159],  
    'weight': [35, 32, 33, 30, 31, 32],  
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},  
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])  
student_data.head(10)

In [1]:
# Importing Pandas
import pandas as pd

In [2]:
# Creating the df:
student_data = pd.DataFrame({  
    'school_code': ['s001','s002','s003','s001','s002','s004'],  
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],  
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],  
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],  
    'age': [12, 12, 13, 13, 14, 12],  
    'height': [173, 192, 186, 167, 151, 159],  
    'weight': [35, 32, 33, 30, 31, 32],  
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},  
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])  

student_data.head(10)

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [6]:
# Grouping the df by 'school_code' and 'class'
grouped_df = student_data.groupby(['school_code', 'class'])

# Iterating through groups and displaying each group as a df
for group_name, group_data in grouped_df:
    print(f"Group: {group_name}")
    print(group_data)
    print("\n")

Group: ('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight
S1        s001     V  Alberto Franco     15/05/2002   12     173      35  \

    address
S1  street1


Group: ('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30  \

    address
S4  street1


Group: ('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32  \
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2


Group: ('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3


Group: ('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight
S6        s004    VI  David Parkes     15/09/1997   12     159      32  \

    address
S6  street4

In [3]:
# Grouping by 'school_code' - overall view (Average)
rename_columns = {'age' : 'average_age', 'height' : 'average_height', 'weight' : 'average_weight'}
split_df = student_data.groupby(['school_code', 'class']).mean(numeric_only=True).rename(columns=rename_columns)
split_df

                   average_age  average_height  average_weight
school_code class
s001        V             12.0           173.0            35.0
            VI            13.0           167.0            30.0
s002        V             13.0           171.5            31.5
s003        VI            13.0           186.0            33.0
s004        VI            12.0           159.0            32.0